viscoelastic/viscoelasticFluidFoam/complexProfile/system/entries/pU
    p
    {
        solver          CG;
        preconditioner  Cholesky;
        tolerance       &pTol;
        relTol          &pRelTol;
        minIter         &pMinIter;
        maxIter         &pMaxIter;
    }
    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       &uTol;
        relTol          &uRelTol;
        minIter         &uMinIter;
        maxIter         &uMaxIter;
    }
