viscoelastic/viscoelasticFluidFoam/complexProfile/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;

    div(phi,U)                      Gauss upwind;
    div((nuEff*dev(T(grad(U)))))    Gauss upwind;

    div(phi,tau)                    Gauss linear;
    div(phi,tauM1)                  Gauss upwind;
    div(phi,tauM2)                  Gauss upwind;
    div(phi,tauM3)                  Gauss upwind;
    div(phi,tauM4)                  Gauss upwind;
    div(phi,tauM5)                  Gauss upwind;
    div(phi,tauM6)                  Gauss upwind;
    div(U)                          Gauss linear;
    div(tau)                        Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;

    laplacian(etaPEff,U)         Gauss linear corrected;
    laplacian(etaPEff+etaS,U)    Gauss linear corrected;
    laplacian(rAU,p)             Gauss linear corrected;
    laplacian((1|A(U)),p)        Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
