viscoelastic/viscoelasticFluidFoam/complexProfile/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile         "total.fms";

maxCellSize         &maxCellSize;

objectRefinements
{
    preParallelZone
    {
        type        box;
        cellSize    &ppzCellSize;
        centre      (50 30 155);
        lengthX     120;
        lengthY     120;
        lengthZ     22;
    }
    parallelZone
    {
        type        box;
        cellSize    &pzCellSize;
        centre      (50 30 185);
        lengthX     120;
        lengthY     120;
        lengthZ     36;
    }
}

// ************************************************************************* //
